[AHW_AA_Terror X2MissionTemplate]
DisplayName="Siege: Haven Massacre"
Briefing="A band of Resistance Operatives' failed attempt to sabotage an ADVENT Blacksite has drawn the Elders' unrelenting wrath onto the Haven that functioned as their base of operations. We need to rescue whatever civilian personnel that we can.. And God save the rest of them."
PostMissionType="Siege: Haven Massacre"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Eliminate the Haven Assault Force if possible."
ObjectiveTextPools[1]="Rescue critical civilian personnel before it's too late."
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Unique.Central_Unique_Missions_Terror_Attack"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_05"
PreMissionNarratives[5]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_01"
PreMissionNarratives[6]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_02"
PreMissionNarratives[7]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_03"
PreMissionNarratives[8]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_04"
PreMissionNarratives[9]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_05"

[AHW_AA_Terror X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Save a minimum of 6 Civilians from the Massacre
ObjectiveTextPools[1]="Eliminate the Haven Assault Force"
ObjectiveTextPools[2]="Extract any surviving XCOM Operatives"

[AHW_AA_ChosenAvengerDefense X2MissionTemplate]
DisplayName="Siege: Avenger Assault"
Briefing="The Chosen have mobilized an overwhelmingly massive strike force in an attempt to strike the heart of the XCOM Project. The Avenger is damaged, we're heavily outnumbered and outgunned. Failure is not an option."
PostMissionType="Siege: Avenger Assault"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Survive the Chosen's Avenger Siege at any cost."

[AHW_AA_ChosenAvengerDefense X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Destroy all turrets targeting the Avenger"
ObjectiveTextPools[1]="Destroy the Siege Cannon's Power Generator"
ObjectiveTextPools[2]="Survive the Chosen's Avenger Siege and Eliminate All Hostile forces."